""" Завдання_2

Написати скрипт, який пройдеться по списку, який складається із кортежів, 
і замінить для кожного кортежа останнє значення.
Список із кортежів можна захардкодити. 
Значення, на яке замінюється останній елемент кортежа вводиться користувачем.
Значення, введене користувачем, можна ніяк не конвертувати (залишити рядком). 
Кількість елементів в кортежу повинна бути різна.

Приклад списка котежів: 
    [(10, 20, 40), (40, 50, 60, 70), (80, 90), (1000,)]
Очікуваний результат, якщо введено '100':
	Expected Output: 
    [(10, 20, '100'), (40, 50, 60, '100'), (80, '100'), ('100',)]
"""

# data from user
data_from_user = input("Please, input value (numbers, letters, etc) for replace it inside tuples:")

# tuples with test data
first_test_tuple = ()
second_test_tuple = ()
first_test_tuple = ()
first_test_tuple = ()