""" Завдання_7

Написати функцію, яка приймає на вхід список 
і підраховує кількість однакових елементів у ньому.
Уточнение к заданию 7: нужно вывести количество повторений элементов в списке 
(элементом может быть что-угодно - число, буква, символ, список, кортеж и т.д.). 
Например для списка [1, 3, 3, 1, 1, 1, 1, g, (1, "a", 2), (1, "a", 2)] - 
результат : 1 - 5 раз, 3 - 2 раза, g - 1 раз, (1, "a", 2) - 2 раза и т.д. 
Считать 1 за повторение или нет - на ваше усмотрение. 
Цель задания: повторение циклов и типов данных
"""

